In [6]:
!pip install pypyodbc

Collecting pypyodbc
  Downloading https://files.pythonhosted.org/packages/ea/48/bb5412846df5b8f97d42ac24ac36a6b77a802c2778e217adc0d3ec1ee7bf/pypyodbc-1.3.5.2.zip
Requirement already satisfied: setuptools in c:\users\ppathak\appdata\local\continuum\anaconda3\lib\site-packages (from pypyodbc) (41.0.1)
Building wheels for collected packages: pypyodbc
  Building wheel for pypyodbc (setup.py): started
  Building wheel for pypyodbc (setup.py): finished with status 'done'
  Stored in directory: C:\Users\ppathak\AppData\Local\pip\Cache\wheels\e4\92\18\b21aa15a7e8915859a6fc10206cdd7f5d9ac098a523b9738c6
Successfully built pypyodbc
Installing collected packages: pypyodbc
Successfully installed pypyodbc-1.3.4

In [21]:
import pandas.io.sql
import pyodbc

In [23]:
conn = pyodbc.connect("Driver={SQL Server};Server=localhost;Database=AdventureWorksDW;uid=demo;pwd=demo")

In [24]:
sql = "select top 5 productkey,ProductAlternateKey from [dbo].[DimProduct]"

In [25]:
df = pandas.io.sql.read_sql(sql, conn)
df.head()

   productkey ProductAlternateKey
0           1             AR-5381
1           2             BA-8327
2         601             BB-7421
3         602             BB-8107
4         603             BB-9108

In [26]:
from sqlalchemy import create_engine

In [29]:
# Parameters
ServerName = "localhost"
Database = "AdventureWorksDW"
Driver = "driver=SQL Server Native Client 11.0"

# Create the connection
conn2 = create_engine('mssql+pyodbc://' + ServerName + '/' + Database + "?" + Driver)

In [30]:
df = pd.read_sql_query("select top 5 productkey,ProductAlternateKey from [dbo].[DimProduct]", conn2)
df

   productkey ProductAlternateKey
0           1             AR-5381
1           2             BA-8327
2         601             BB-7421
3         602             BB-8107
4         603             BB-9108